; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	spectrograph0 - mode
	spectrograph1 - mode
	thermograph3 - mode
	thermograph2 - mode
	Star0 - direction
	GroundStation1 - direction
	Star4 - direction
	Star2 - direction
	GroundStation3 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument2 spectrograph0)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument5 spectrograph1)
	(supports instrument5 thermograph2)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star4)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet5)
	(supports instrument6 spectrograph0)
	(supports instrument6 thermograph3)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 Star2)
	(supports instrument7 spectrograph0)
	(supports instrument7 thermograph3)
	(calibration_target instrument7 Star2)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation1)
	(supports instrument8 thermograph2)
	(supports instrument8 spectrograph1)
	(supports instrument8 spectrograph0)
	(calibration_target instrument8 GroundStation3)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation1)
)
(:goal (and
	(pointing satellite1 Star9)
	(pointing satellite2 Star4)
	(pointing satellite4 GroundStation3)
	(have_image Planet5 thermograph3)
	(have_image Phenomenon6 spectrograph0)
	(have_image Star7 thermograph2)
	(have_image Phenomenon8 thermograph2)
	(have_image Star9 spectrograph1)
	(have_image Star10 thermograph3)
))

)

; plan
1. (turn_to satellite3 star2 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 star2)
   goals met: 0 of 9
2. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 0 of 9
3. (calibrate satellite3 instrument6 star2)
   added: (calibrated instrument6)
   goals met: 0 of 9
4. (turn_to satellite3 star10 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 star10)
   goals met: 0 of 9
5. (take_image satellite3 star10 instrument6 thermograph3)
   added: (have_image star10 thermograph3)
   goals met: 1 of 9
6. (turn_to satellite3 planet5 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 planet5)
   goals met: 1 of 9
7. (take_image satellite3 planet5 instrument6 thermograph3)
   added: (have_image planet5 thermograph3)
   goals met: 2 of 9
8. (turn_to satellite3 phenomenon6 planet5)
   deleted: (pointing satellite3 planet5)
   added: (pointing satellite3 phenomenon6)
   goals met: 2 of 9
9. (turn_to satellite2 star4 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 star4)
   goals met: 3 of 9
10. (take_image satellite3 phenomenon6 instrument6 spectrograph0)
   added: (have_image phenomenon6 spectrograph0)
   goals met: 4 of 9
11. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 4 of 9
12. (calibrate satellite1 instrument4 star4)
   added: (calibrated instrument4)
   goals met: 4 of 9
13. (turn_to satellite1 phenomenon8 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon8)
   goals met: 4 of 9
14. (take_image satellite1 phenomenon8 instrument4 thermograph2)
   added: (have_image phenomenon8 thermograph2)
   goals met: 5 of 9
15. (turn_to satellite1 star7 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star7)
   goals met: 5 of 9
16. (take_image satellite1 star7 instrument4 thermograph2)
   added: (have_image star7 thermograph2)
   goals met: 6 of 9
17. (turn_to satellite1 star9 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star9)
   goals met: 7 of 9
18. (turn_to satellite3 star9 phenomenon6)
   deleted: (pointing satellite3 phenomenon6)
   added: (pointing satellite3 star9)
   goals met: 7 of 9
19. (take_image satellite3 star9 instrument6 spectrograph1)
   added: (have_image star9 spectrograph1)
   goals met: 8 of 9
20. (turn_to satellite4 groundstation3 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 groundstation3)
   goals met: 9 of 9
